tap "homebrew/bundle"
tap "homebrew/services"

brew "git"
brew "nvm"
cask "1password"
cask "1password-cli"
cask "amazon-q"
cask "cleanshot"
cask "google-chrome"
cask "iterm2"
cask "raycast"
cask "slack"
cask "spotify"
cask "unnaturalscrollwheels"
cask "visual-studio-code"

vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "firsttris.vscode-jest-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gruntfuggly.todo-tree"
vscode "humao.rest-client"
vscode "linhmtran168.mac-ca-vscode"
vscode "mattpocock.ts-error-translator"
vscode "maximus136.change-string-case"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "nrwl.angular-console"
vscode "oouo-diogo-perdigao.docthis"
vscode "redhat.vscode-yaml"
vscode "sdras.night-owl"
vscode "statelyai.stately-vscode"
vscode "styled-components.vscode-styled-components"
vscode "tahabasri.snippets"
vscode "unifiedjs.vscode-mdx"
vscode "unional.vscode-sort-package-json"
vscode "vitaliymaz.vscode-svg-previewer"
vscode "vitest.explorer"
vscode "yoavbls.pretty-ts-errors"
